import streamlit as st
import pandas as pd
st.subheader('🗺️店铺所在地')
map_data = {
    'latitude':[22.854160, 22.840392, 22.838409, 22.841667, 22.847446],
    'longitude':[108.222322, 108.245341, 108.217607, 108.245700, 108.220922],
    }
st.map(pd.DataFrame(map_data))

st.subheader('🍽1-3到店人数')
data = {
    '恰好铺子':[200, 150, 180],
    '重庆小面':[120, 160, 123],
    '兰师傅柳州螺蛳粉':[110, 100, 160],
    '蜜雪冰城':[512,625,456],
    '兰州拉面':[545,523,342],
}

df = pd.DataFrame(data)
index = pd.Series(["1月", "2月", "3月",], name='月份')
df.index = index

st.dataframe(df)

st.line_chart(df)



st.subheader('⭐评分')
data = {
    '恰好铺子':[8.2,8.6,8.4,8.4],
    '重庆小面':[8.5,8.6,8.7,8.8],
    '兰师傅柳州螺蛳粉':[9.2,9.4,8.5,9.3],
    '蜜雪冰城':[9.5,9.3,8.6,9.4],
    '兰州拉面':[9.5,9.3,9.4,7.4],
}

df = pd.DataFrame(data)
index = pd.Series(["早餐","午餐","晚餐","下午茶"], name='评分')
df.index = index

st.bar_chart(df)



st.subheader('💸1-12月的价格')
data = {
    '恰好铺子':[30,31,35,14,15,13,31,54,32,34,31,21],
    '重庆小面':[21,12,42,12,12,31,21,41,13,11,12,21],
    '兰师傅柳州螺蛳粉':[12,32,42,53,12,34,46,34,46,67,37,33],
    '蜜雪冰城':[9,16,21,23,15,16,24,20,19,17,18,13],
    '兰州拉面':[12,13,11,12,14,13,14,15,21,13,14,16],
}

df = pd.DataFrame(data)
index = pd.Series(["1月", "2月", "3月","4月","5月","6月","7月","8月","9月","10月","11月","12月"], name='月份')
df.index = index

st.line_chart(df)

data = {
    '恰好铺子':[350,351,385,194,175,163,371,584,382,354,351,261],
    '重庆小面':[251,152,482,172,142,351,231,471,123,181,122,221],
    '兰师傅柳州螺蛳粉':[182,382,462,535,162,342,456,354,456,667,377,373],
    '蜜雪冰城':[92,156,251,293,125,176,244,230,159,127,188,123],
    '兰州拉面':[112,173,131,122,174,133,124,175,231,123,174,316],
}
df = pd.DataFrame(data)
index = pd.Series(["1月", "2月", "3月","4月","5月","6月","7月","8月","9月","10月","11月","12月"], name='月份')
df.index = index
st.area_chart(df)
image_path=r'D:\\streamlit_env\111.jpeg'
st.image(image_path,caption='111')

